public_html/Linux/Shell Scrap.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Shell Scrap</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Shell Scrap"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-27 10:23:51 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Shell Scrap</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Flow Control</a>
<ul>
<li><a href="#sec-1-1">if</a></li>
<li><a href="#sec-1-2">case</a></li>
<li><a href="#sec-1-3">Loops</a></li>
</ul>
</li>
<li><a href="#sec-2">Keyboard Input</a>
<ul>
<li><a href="#sec-2-1">read</a></li>
</ul>
</li>
<li><a href="#sec-3">Parameters</a>
<ul>
<li><a href="#sec-3-1"><code>$#</code></a></li>
<li><a href="#sec-3-2"><code>shift</code></a></li>
</ul>
</li>
<li><a href="#sec-4">Errors and Signals and Traps</a>
<ul>
<li><a href="#sec-4-1">Exit status</a></li>
</ul>
</li>
<li><a href="#sec-5">Creating safe temporary files</a>
<ul>
<li><a href="#sec-5-1">example</a></li>
</ul>
</li>
<li><a href="#sec-6">Debug</a>
<ul>
<li><a href="#sec-6-1">Watching your script run</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Flow Control</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">if</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li id="sec-1-1-1">syntax<br/>



<pre class="src src-sh"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">First form</span>

<span style="color: #00ffff;">if</span> condition ; <span style="color: #00ffff;">then</span>
    commands
<span style="color: #00ffff;">fi</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Second form</span>

<span style="color: #00ffff;">if</span> condition ; <span style="color: #00ffff;">then</span>
    commands
<span style="color: #00ffff;">else</span>
    commands
<span style="color: #00ffff;">fi</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Third form</span>

<span style="color: #00ffff;">if</span> condition ; <span style="color: #00ffff;">then</span>
    commands
<span style="color: #00ffff;">elif</span> condition ; <span style="color: #00ffff;">then</span>
    commands
<span style="color: #00ffff;">fi</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-1-1-2">Example<br/>



<pre class="src src-sh"><span style="color: #00ffff;">if</span> [ -f .bash_profile ]; <span style="color: #00ffff;">then</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"You have a .bash_profile. Things are fine."</span>
<span style="color: #00ffff;">else</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Yikes! You have no .bash_profile!"</span>
<span style="color: #00ffff;">fi</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-1-1-3">Condition<br/>
Expression    Description

<ul>
<li>-d file True if file is a directory.
</li>
<li>-e file True if file exists.
</li>
<li>-f file True if file exists and is a regular file.
</li>
<li>-L file True if file is a symbolic link.
</li>
<li>-r file True if file is a file readable by you.
</li>
<li>-w file True if file is a file writable by you.
</li>
<li>-x file True if file is a file executable by you.
</li>
<li>file1 -nt file2  True if file1 is newer than (according to modification time) file2
</li>
<li>file1 -ot file2  True if file1 is older than file2
</li>
<li>-z string True if string is empty.
</li>
<li>-n string  True if string is not empty.
</li>
<li>string1 = string2  True if string1 equals string2.
</li>
<li>string1 != string2  True if string1 does not equal string2.
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">case</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li id="sec-1-2-1">syntax<br/>



<pre class="src src-sh"><span style="color: #00ffff;">case</span> word<span style="color: #00ffff;"> in</span>
    patterns ) statements ;;
<span style="color: #00ffff;">esac</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-1-2-2">example<br/>



<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">"Enter a number between 1 and 3 inclusive &gt; "</span>
<span style="color: #b0c4de;">read</span> character
<span style="color: #00ffff;">case</span> $<span style="color: #eedd82;">character</span><span style="color: #00ffff;"> in</span>
    1 ) <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"You entered one."</span>
        ;;
    2 ) <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"You entered two."</span>
        ;;
    3 ) <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"You entered three."</span>
        ;;
    * ) <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"You did not enter a number"</span>
        <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"between 1 and 3."</span>
<span style="color: #00ffff;">esac</span>
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Loops</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li id="sec-1-3-1">while<br/>
<ul>
<li id="sec-1-3-1-1">example<br/>



<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>

<span style="color: #eedd82;">number</span>=0
<span style="color: #00ffff;">while</span> [ $<span style="color: #eedd82;">number</span> -lt 10 ]; <span style="color: #00ffff;">do</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Number = $number"</span>
    <span style="color: #eedd82;">number</span>=$((number + 1))
<span style="color: #00ffff;">done</span>
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-3-2">until<br/>
The until command works exactly the same way, except the block of code
is repeated as long as the condition is false.

<ul>
<li id="sec-1-3-2-1">Example<br/>



<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>

<span style="color: #eedd82;">number</span>=0
<span style="color: #00ffff;">until</span> [ $<span style="color: #eedd82;">number</span> -ge 10 ]; <span style="color: #00ffff;">do</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Number = $number"</span>
    <span style="color: #eedd82;">number</span>=$((number + 1))
<span style="color: #00ffff;">done</span>
</pre>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-3-3"><code>for</code><br/>
<ul>
<li id="sec-1-3-3-1">syntax<br/>



<pre class="src src-sh"><span style="color: #00ffff;">for</span> variable<span style="color: #00ffff;"> in</span> words; <span style="color: #00ffff;">do</span>
    statements
<span style="color: #00ffff;">done</span>
</pre>

</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Keyboard Input</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">read</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li id="sec-2-1-1">example<br/>



<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span><span style="color: #ff7f24;"> </span>

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">"Enter some text &gt; "</span>
<span style="color: #b0c4de;">read</span> text
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"You entered: $text"</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-2-1-2">option <code>-t</code> (time)<br/>
The -t option followed by a number of seconds provides an automatic
timeout for the read command. 



<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>
<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">"Hurry up and type something! &gt; "</span>
<span style="color: #00ffff;">if </span><span style="color: #b0c4de;">read</span> -t 3 response; <span style="color: #00ffff;">then</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Great, you made it in time!"</span>
<span style="color: #00ffff;">else</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Sorry, you are too slow!"</span>
<span style="color: #00ffff;">fi</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-2-1-3">option <code>-s</code><br/>
The -s option causes the user's typing not to be displayed. 

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Parameters</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><code>$#</code></h3>
<div class="outline-text-3" id="text-3-1">

<p>the shell maintains a variable called $# that contains the number of
items on the command line
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><code>shift</code></h3>
<div class="outline-text-3" id="text-3-2">

<p><code>shift</code> is a shell builtin that operates on the positional parameters.
Each time you invoke shift, it "shifts" all the positional parameters
down by one. $2 becomes $1, $3 becomes $2, $4 becomes $3, and so on.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Errors and Signals and Traps</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Exit status</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li id="sec-4-1-1">Checking the exit status<br/>
First, you can examine the contents of the $? environment variable. $?
will contain the exit status of the last command executed.




<pre class="src src-sh">[me] $ true; <span style="color: #b0c4de;">echo</span> $<span style="color: #eedd82;">?</span>
0
[me] $ false; <span style="color: #b0c4de;">echo</span> $<span style="color: #eedd82;">?</span>
1
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Creating safe temporary files</h2>
<div class="outline-text-2" id="text-5">

<p>The preferred technique is to write them in a local directory such as
<code>~/tmp</code> (a tmp subdirectory in the user's home directory.) If you must
write files in <code>/tmp</code>, you must take steps to make sure the file names
are not predictable. Predictable file names allow an attacker to
create symbolic links to other files that the attacker wants you to
overwrite.
</p>
</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">example</h3>
<div class="outline-text-3" id="text-5-1">




<pre class="src src-sh"><span style="color: #eedd82;">TEMP_FILE</span>=$<span style="color: #eedd82;">TEMP_DIR</span>/printfile.$<span style="color: #eedd82;">$</span>.$<span style="color: #eedd82;">RANDOM</span>
</pre>

<ul>
<li><code>$$</code> shell variable to embed the process id (pid) of the program
</li>
<li><code>$RANDOM</code> shell variable to append a random number to the file name
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Debug</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Watching your script run</h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li id="sec-6-1-1">Method1<br/>



<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span><span style="color: #ff7f24;"> -x</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-6-1-2">Method2<br/>
you can use the set command within your script to turn tracing on and
off. Use <code>set -x</code> to turn tracing on and <code>set +x</code> to turn tracing off. For
example.:




<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>

<span style="color: #eedd82;">number</span>=1

<span style="color: #b0c4de;">set</span> -x
<span style="color: #00ffff;">if</span> [ $<span style="color: #eedd82;">number</span> = <span style="color: #ffa07a;">"1"</span> ]; <span style="color: #00ffff;">then</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Number equals 1"</span>
<span style="color: #00ffff;">else</span>
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"Number does not equal 1"</span>
<span style="color: #00ffff;">fi</span>
<span style="color: #b0c4de;">set</span> +x
</pre>

</li>
</ul>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-27 10:23:51 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
